import axios from "axios";
export default class CallService{
    static async getAll(){
        try{

        const response = await  axios.get('https://jsonplaceholder.typicode.com/posts')
        return [
            { id: 1, problem: 'Перша проблема на традиційному процесі', remedy: '1Рішення' },
            { id: 2, problem: 'Друга проблема на традиційному процесі', remedy: '2Рішення' },
            { id: 3, problem: 'Третя проблема на традиційному процесі', remedy: '3Рішення' },
            { id: 4, problem: 'Четверта проблема на традиційному процесі', remedy: '4Рішення' },
            { id: 5, problem: "П'ята проблема на традиційному процесі", remedy: 'я Рішення' },
            { id: 6, problem: 'Шоста проблема на традиційному процесі', remedy: '0 Рішення' },
            { id: 7, problem: 'Перша проблема на традиційному процесі', remedy: '1Рішення' },
            { id: 8, problem: 'Друга проблема на традиційному процесі', remedy: '2Рішення' },
            { id: 9, problem: 'Третя проблема на традиційному процесі', remedy: '3Рішення' },
            { id: 10, problem: 'Четверта проблема на традиційному процесі', remedy: '4Рішення' },
            { id: 11, problem: "П'ята проблема на традиційному процесі", remedy: 'я Рішення' },
            { id: 12, problem: 'Шоста проблема на традиційному процесі', remedy: '0 Рішення' },
            { id: 13, problem: 'Перша проблема на традиційному процесі', remedy: '1Рішення' },
            { id: 14, problem: 'Друга проблема на традиційному процесі', remedy: '2Рішення' },
            { id: 15, problem: 'Третя проблема на традиційному процесі', remedy: '3Рішення' },
            { id: 16, problem: 'Четверта проблема на традиційному процесі', remedy: '4Рішення' },
            { id: 17, problem: "П'ята проблема на традиційному процесі", remedy: 'я Рішення' },
            { id: 18, problem: 'Шоста проблема на традиційному процесі', remedy: '0 Рішення' },
            { id: 19, problem: 'Перша проблема на традиційному процесі', remedy: '1Рішення' },
            { id: 20, problem: 'Друга проблема на традиційному процесі', remedy: '2Рішення' },
            { id: 21, problem: 'Третя проблема на традиційному процесі', remedy: '3Рішення' },
            { id: 22, problem: 'Четверта проблема на традиційному процесі', remedy: '4Рішення' },
            { id: 23, problem: "П'ята проблема на традиційному процесі", remedy: 'я Рішення' },
            { id: 24, problem: 'Шоста проблема на традиційному процесі', remedy: '0 Рішення' },
          ]
        } catch (e) {
            console.log(e);
        }
    }
}